#include<stdio.h>

int main(){
    char num=0b11111111;
    num=num&0b11111111;//大一上 All Pase
    num=num&0b11111101;//在大一下時，小明因為微積分翹了太多節課，期末拿了58分，被當掉了
    num=num&0b11111011;//在大二上時，修了密碼學，但因為要算很多數學，一直算錯，拿了57分，被當了
    num=num&0b11111111;//在大二上的學期末，跑到密碼學老師的辦公室跟他求情，老師幫他加到60分
    num=num&0b11111111;//大二下 All Pase
    num=num&0b11101111;//在大三上時，因為在英文課一直睡覺，期末拿了50分，被當掉了
    num=num&0b11111111;//大三下 All Pase
    num=num&0b10111111;//在大四上時，修了深度學習，但學習狀況不佳，期末只拿了40分，被當了
    num=num&0b11111111;//大四下 All Pase

    printf("大一上:%d\n",num&0b00000001);
    printf("大一下:%d\n",num&0b00000000>>1);
    printf("大二上:%d\n",num&0b00000100>>2);
    printf("大二下:%d\n",num&0b00001000>>3);
    printf("大三上:%d\n",num&0b00000000>>4);
    printf("大三下:%d\n",num&0b00100000>>5);
    printf("大四上:%d\n",num&0b00000000>>6);
    printf("大四下:%d\n",num&0b10000000>>7);

    return 0;
}
