#include <stdio.h>

int main(){

	char a=0b11111111;
	
	a= a&0b11111111;  //在大一上歐趴 11111111
	a= a&0b11111101;  //在大一下時，小明因為微積分翹了太多節課，期末拿了58分，被當掉了 11111101
	a= a&0b11111011;  //在大二上時，修了密碼學，但因為要算很多數學，一直算錯，拿了57分，被當了 11111001
	a= a|0b11111001;  //在大二上的學期末，跑到密碼學老師的辦公室跟他求情，老師幫他加到60分  11111101
	a= a&0b11111111;  //在大二下歐趴 11111101
	a= a&0b11101111;  //在大三上時，因為在英文課一直睡覺，期末拿了50分，被當掉了  11101101
	a= a&0b11111111;  //在大三下歐趴 11101101 
	a= a&0b10111111;  //在大四上時，修了深度學習，但學習狀況不佳，期末只拿了40分，被當了  10101101 
	a= a&0b11111111;  //在大四下歐趴  10101101


	//printf ("%d",a);
	printf("大一上：%d\n大一下：%d\n大二上：%d\n大二下：%d\n大三上：%d\n大三下：%d\n大四上：%d\n大四下：%d\n",a&0b00000001,a&0b00000010,a&0b00000100>>2,a&0b00001000>>3,a&0b00010000,a&0b00100000>>5,a&0b01000000,a&0b10000000>>7);
	//大一上：1
	//大一下：0 00000000
	//大二上：1 00000100 >>2
	//大二下：1 00001000 >>3
	//大三上：0 00000000
	//大三下：1 00100000 >>5
	//大四上：0 00000000
	//大四下：1 10000000 >>7


	
	

    return 0;
}
