#include<stdio.h>
#include<stdlib.h>
int main()
{
    char val1=0b11111111;
    //1.在大一下時，小明因為微積分翹了太多節課，期末拿了58分，被當掉了
    val1=val1&0b10111111;
    //2. 在大二上時，修了密碼學，但因為要算很多數學，一直算錯，拿了57分，被當了
    val1=val1^0b00100000;
    //3. 在大二上的學期末，跑到密碼學老師的辦公室跟他求情，老師幫他加到60分
    val1=val1|0b10111111;
    //4. 在大三上時，因為在英文課一直睡覺，期末拿了50分，被當掉了
    val1=val1&0b10110111;
    //5. 在大四上時，修了深度學習，但學習狀況不佳，期末只拿了40分，被當了
    val1=val1&0b10110101;
    printf("大一上：%d\n",(val1&(1<<7))>>7);
    printf("大一下：%d\n",(val1&(1<<6))>>6);
    printf("大二上: %d\n",(val1&(1<<5))>>5);
    printf("大二下：%d\n",(val1&(1<<4))>>4);
    printf("大三上：%d\n",(val1&(1<<3))>>3);
    printf("大三下：%d\n",(val1&(1<<2))>>2);
    printf("大四上：%d\n",(val1&(1<<1))>>1);
    printf("大四下：%d\n",(val1&(1<<0))>>0);
    return 0;
}
