#include <stdio.h>


    int main(){

    char sem,sem1,sem2,sem3,sem4,sem5,sem6,sem7,sem8,count;
      sem = 0b00000000;
      sem1 = sem  | 0b10000000;//10000000
      sem2 = sem1 | 0b00000000;//10000000 在大一下時，小明因為微積分翹了太多節課，期末拿了58分，被當掉了
      sem3 = sem2 | 0b00100000;//10100000 在大二上時，修了密碼學，但因為要算很多數學，一直算錯，拿了57分，被當了
      sem4 = sem3 | 0b00010000;//10110000 在大二上的學期末，跑到密碼學老師的辦公室跟他求情，老師幫他加到60分
      sem5 = sem4 | 0b00000000;//10110000 在大三上時，因為在英文課一直睡覺，期末拿了50分，被當掉了
      sem6 = sem5 | 0b00000100;//10110100
      sem7 = sem6 | 0b00000000;//10110100 在大四上時，修了深度學習，但學習狀況不佳，期末只拿了40分，被當了
      sem8 = sem7 | 0b00000001;//10110101



    int a;
    for(a = 7; a >= 0; a --){
        char count = (sem8 & (1 <<a )) >> a;
        printf("Semester = %d\n",count);

    }

    }
