#include <stdio.h>
#include <stdlib.h>

int main()
{
    char a = 0b11111111;
    a^=0b00000010;//0b1111 1101,第一個事件
    a&=0b11111011;//0b1111 1001,第二個事件
    a^=0b00000100;//ob1111 1101,第三個事件
    a^=0b00010000;//0b1110 1101,第四個事件
    a^=0b01000000;//0b1010 1101,第五個事件
    printf("大一上:%d\n",a&0b00000001);
    printf("大一下:%d\n",(a&0b00000010)>>1);
    printf("大二上:%d\n",(a&0b00000100)>>2);
    printf("大二下:%d\n",(a&0b00001000)>>3);
    printf("大三上:%d\n",(a&0b00010000)>>4);
    printf("大三下:%d\n",(a&0b00100000)>>5);
    printf("大四上:%d\n",(a&0b01000000)>>6);
    printf("大四下:%d\n",(a&0b10000000)>>7);
}
